Revit 2024 API
FormatValueOptions Class
 Options for formatting numbers with units into strings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class FormatValueOptions : IDisposable
Visual Basic
Public Class FormatValueOptions _
	Implements IDisposable
Visual C++
public ref class FormatValueOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormatValueOptions
See Also
FormatValueOptions Members
Autodesk.Revit.DB Namespace